k6/orders-test-resultados-10.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/orders-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 1m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/100 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 001/100 VUs  0m01.0s/1m00.0s

running (0m02.0s), 002/100 VUs, 12 complete and 0 interrupted iterations
default   [   3% ] 002/100 VUs  0m02.0s/1m00.0s

running (0m03.0s), 002/100 VUs, 43 complete and 0 interrupted iterations
default   [   5% ] 002/100 VUs  0m03.0s/1m00.0s

running (0m04.0s), 003/100 VUs, 117 complete and 0 interrupted iterations
default   [   7% ] 003/100 VUs  0m04.0s/1m00.0s

running (0m05.0s), 003/100 VUs, 152 complete and 0 interrupted iterations
default   [   8% ] 003/100 VUs  0m05.0s/1m00.0s

running (0m06.0s), 004/100 VUs, 165 complete and 0 interrupted iterations
default   [  10% ] 004/100 VUs  0m06.0s/1m00.0s

running (0m07.0s), 005/100 VUs, 182 complete and 0 interrupted iterations
default   [  12% ] 005/100 VUs  0m07.0s/1m00.0s

running (0m08.0s), 005/100 VUs, 189 complete and 0 interrupted iterations
default   [  13% ] 005/100 VUs  0m08.0s/1m00.0s

running (0m09.0s), 006/100 VUs, 199 complete and 0 interrupted iterations
default   [  15% ] 006/100 VUs  0m09.0s/1m00.0s

running (0m10.0s), 006/100 VUs, 208 complete and 0 interrupted iterations
default   [  17% ] 006/100 VUs  0m10.0s/1m00.0s

running (0m11.0s), 007/100 VUs, 219 complete and 0 interrupted iterations
default   [  18% ] 007/100 VUs  0m11.0s/1m00.0s

running (0m12.0s), 008/100 VUs, 255 complete and 0 interrupted iterations
default   [  20% ] 008/100 VUs  0m12.0s/1m00.0s

running (0m13.0s), 008/100 VUs, 271 complete and 0 interrupted iterations
default   [  22% ] 008/100 VUs  0m13.0s/1m00.0s

running (0m14.0s), 009/100 VUs, 275 complete and 0 interrupted iterations
default   [  23% ] 009/100 VUs  0m14.0s/1m00.0s

running (0m15.0s), 009/100 VUs, 286 complete and 0 interrupted iterations
default   [  25% ] 009/100 VUs  0m15.0s/1m00.0s

running (0m16.0s), 012/100 VUs, 298 complete and 0 interrupted iterations
default   [  27% ] 012/100 VUs  0m16.0s/1m00.0s

running (0m17.0s), 015/100 VUs, 301 complete and 0 interrupted iterations
default   [  28% ] 015/100 VUs  0m17.0s/1m00.0s

running (0m18.0s), 017/100 VUs, 321 complete and 0 interrupted iterations
default   [  30% ] 017/100 VUs  0m18.0s/1m00.0s

running (0m19.0s), 020/100 VUs, 351 complete and 0 interrupted iterations
default   [  32% ] 020/100 VUs  0m19.0s/1m00.0s

running (0m20.0s), 023/100 VUs, 393 complete and 0 interrupted iterations
default   [  33% ] 023/100 VUs  0m20.0s/1m00.0s

running (0m21.0s), 025/100 VUs, 447 complete and 0 interrupted iterations
default   [  35% ] 025/100 VUs  0m21.0s/1m00.0s

running (0m22.0s), 028/100 VUs, 493 complete and 0 interrupted iterations
default   [  37% ] 028/100 VUs  0m22.0s/1m00.0s

running (0m23.0s), 031/100 VUs, 521 complete and 0 interrupted iterations
default   [  38% ] 031/100 VUs  0m23.0s/1m00.0s

running (0m24.0s), 033/100 VUs, 568 complete and 0 interrupted iterations
default   [  40% ] 033/100 VUs  0m24.0s/1m00.0s

running (0m25.0s), 036/100 VUs, 623 complete and 0 interrupted iterations
default   [  42% ] 036/100 VUs  0m25.0s/1m00.0s

running (0m26.0s), 039/100 VUs, 674 complete and 0 interrupted iterations
default   [  43% ] 039/100 VUs  0m26.0s/1m00.0s

running (0m27.0s), 041/100 VUs, 722 complete and 0 interrupted iterations
default   [  45% ] 041/100 VUs  0m27.0s/1m00.0s

running (0m28.0s), 044/100 VUs, 787 complete and 0 interrupted iterations
default   [  47% ] 044/100 VUs  0m28.0s/1m00.0s

running (0m29.0s), 047/100 VUs, 896 complete and 0 interrupted iterations
default   [  48% ] 047/100 VUs  0m29.0s/1m00.0s

running (0m30.0s), 049/100 VUs, 997 complete and 0 interrupted iterations
default   [  50% ] 049/100 VUs  0m30.0s/1m00.0s

running (0m31.0s), 053/100 VUs, 1070 complete and 0 interrupted iterations
default   [  52% ] 053/100 VUs  0m31.0s/1m00.0s

running (0m32.0s), 056/100 VUs, 1166 complete and 0 interrupted iterations
default   [  53% ] 056/100 VUs  0m32.0s/1m00.0s

running (0m33.0s), 059/100 VUs, 1170 complete and 0 interrupted iterations
default   [  55% ] 059/100 VUs  0m33.0s/1m00.0s

running (0m34.0s), 063/100 VUs, 1224 complete and 0 interrupted iterations
default   [  57% ] 063/100 VUs  0m34.0s/1m00.0s

running (0m35.0s), 066/100 VUs, 1325 complete and 0 interrupted iterations
default   [  58% ] 066/100 VUs  0m35.0s/1m00.0s

running (0m36.0s), 069/100 VUs, 1374 complete and 0 interrupted iterations
default   [  60% ] 069/100 VUs  0m36.0s/1m00.0s

running (0m37.0s), 073/100 VUs, 1379 complete and 0 interrupted iterations
default   [  62% ] 073/100 VUs  0m37.0s/1m00.0s

running (0m38.0s), 076/100 VUs, 1390 complete and 0 interrupted iterations
default   [  63% ] 076/100 VUs  0m38.0s/1m00.0s

running (0m39.0s), 079/100 VUs, 1437 complete and 0 interrupted iterations
default   [  65% ] 079/100 VUs  0m39.0s/1m00.0s

running (0m40.0s), 083/100 VUs, 1511 complete and 0 interrupted iterations
default   [  67% ] 083/100 VUs  0m40.0s/1m00.0s

running (0m41.0s), 086/100 VUs, 1599 complete and 0 interrupted iterations
default   [  68% ] 086/100 VUs  0m41.0s/1m00.0s

running (0m42.0s), 089/100 VUs, 1684 complete and 0 interrupted iterations
default   [  70% ] 089/100 VUs  0m42.0s/1m00.0s

running (0m43.0s), 093/100 VUs, 1713 complete and 0 interrupted iterations
default   [  72% ] 093/100 VUs  0m43.0s/1m00.0s

running (0m44.0s), 096/100 VUs, 1763 complete and 0 interrupted iterations
default   [  73% ] 096/100 VUs  0m44.0s/1m00.0s

running (0m45.0s), 099/100 VUs, 1835 complete and 0 interrupted iterations
default   [  75% ] 099/100 VUs  0m45.0s/1m00.0s

running (0m46.0s), 098/100 VUs, 1923 complete and 0 interrupted iterations
default   [  77% ] 098/100 VUs  0m46.0s/1m00.0s

running (0m47.0s), 094/100 VUs, 2008 complete and 0 interrupted iterations
default   [  78% ] 094/100 VUs  0m47.0s/1m00.0s

running (0m48.0s), 087/100 VUs, 2076 complete and 0 interrupted iterations
default   [  80% ] 087/100 VUs  0m48.0s/1m00.0s

running (0m49.0s), 079/100 VUs, 2160 complete and 0 interrupted iterations
default   [  82% ] 079/100 VUs  0m49.0s/1m00.0s

running (0m50.0s), 068/100 VUs, 2218 complete and 0 interrupted iterations
default   [  83% ] 068/100 VUs  0m50.0s/1m00.0s

running (0m51.0s), 064/100 VUs, 2320 complete and 0 interrupted iterations
default   [  85% ] 064/100 VUs  0m51.0s/1m00.0s

running (0m52.0s), 061/100 VUs, 2373 complete and 0 interrupted iterations
default   [  87% ] 061/100 VUs  0m52.0s/1m00.0s

running (0m53.0s), 058/100 VUs, 2396 complete and 0 interrupted iterations
default   [  88% ] 058/100 VUs  0m53.0s/1m00.0s

running (0m54.0s), 044/100 VUs, 2435 complete and 0 interrupted iterations
default   [  90% ] 044/100 VUs  0m54.0s/1m00.0s

running (0m55.0s), 036/100 VUs, 2535 complete and 0 interrupted iterations
default   [  92% ] 036/100 VUs  0m55.0s/1m00.0s

running (0m56.0s), 029/100 VUs, 2607 complete and 0 interrupted iterations
default   [  93% ] 029/100 VUs  0m56.0s/1m00.0s

running (0m57.0s), 022/100 VUs, 2700 complete and 0 interrupted iterations
default   [  95% ] 022/100 VUs  0m57.0s/1m00.0s

running (0m58.0s), 018/100 VUs, 2737 complete and 0 interrupted iterations
default   [  97% ] 018/100 VUs  0m58.0s/1m00.0s

running (0m59.0s), 008/100 VUs, 2812 complete and 0 interrupted iterations
default   [  98% ] 008/100 VUs  0m59.0s/1m00.0s

running (1m00.0s), 001/100 VUs, 2876 complete and 0 interrupted iterations
default   [ 100% ] 001/100 VUs  1m00.0s/1m00.0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration.......................................................: avg=852.37ms min=2.04ms  med=602.49ms max=4.41s p(90)=2.03s p(95)=2.57s
      { expected_response:true }............................................: avg=912.85ms min=16.67ms med=689.29ms max=4.41s p(90)=2.12s p(95)=2.6s 
    http_req_failed.........................................................: 7.26%  209 out of 2878
    http_reqs...............................................................: 2878   47.951944/s

    EXECUTION
    iteration_duration......................................................: avg=852.49ms min=2.12ms  med=602.59ms max=4.41s p(90)=2.03s p(95)=2.57s
    iterations..............................................................: 2878   47.951944/s
    vus.....................................................................: 1      min=1           max=99 
    vus_max.................................................................: 100    min=100         max=100

    NETWORK
    data_received...........................................................: 1.5 MB 25 kB/s
    data_sent...............................................................: 239 kB 4.0 kB/s



running (1m00.0s), 000/100 VUs, 2878 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  1m0s